import { BeakerIcon, BuildingOfficeIcon, CalendarDaysIcon, BuildingOffice2Icon, CameraIcon, ExclamationTriangleIcon, FireIcon, HomeIcon, ShieldCheckIcon, TrashIcon, UserGroupIcon, WrenchScrewdriverIcon, LockClosedIcon, TruckIcon, CircleStackIcon, MapPinIcon, ScaleIcon, PaintBrushIcon, ArrowsPointingOutIcon, HeartIcon, ScaleIcon as LegalScaleIcon, PhoneIcon, AcademicCapIcon, BuildingLibraryIcon } from "@heroicons/react/24/outline";
export const regularActivitiesData = [
  {
    id: 1,
    name: "পরিচ্ছন্নতা",
    icon: TrashIcon,
    description: "ঢাকা উত্তর সিটি কর্পোরেশনের সাথে সম্পাদিত সমঝোতা স্মারক অনুসারে গুলশান অ্যাভিনিউ ব্যতীত গুলশানের সকল রাস্তার দৈনিক রক্ষণাবেক্ষণ ও পরিচ্ছন্নতার দায়িত্ব গুলশান সোসাইটির উপর ন্যস্ত করা হয়েছে। পরিচ্ছন্নতা কার্যক্রমের অংশ হিসেবে ২ জন সুপারভাইজার এর নেতৃত্বে ৮০ জন পরিচ্ছন্নতাকর্মী দিন-রাত গুলশানের প্রতিটি রাস্তা, ফুটপাথ ও অগভীর ড্রেন পরিষ্কার করছে। বর্জ্য নিষ্কাশনের পরে তা ৩টি ট্রাকে করে পৌঁছে দেওয়া হচ্ছে নিকটবর্তী সেকেন্ডারি ট্রান্সফার স্টেশনে",
  },
  {
    id: 2,
    name: "নিরাপত্তা",
    icon: ShieldCheckIcon,
    description: "ঢাকা উত্তর সিটি কর্পোরেশনের সম্মতিপূর্বক অচিরেই গুলশান সোসাইটি নির্মাণ করতে যাচ্ছে ৬৪টি অত্যাধুনিক গেট যা গুলশানকে একটি সুরক্ষিত আবাসিক এলাকায় পরিণত করবে। গুলশান সোসাইটি সর্বদাই এলাকার নিরাপত্তার জন্য নিরলস ভাবে কাজ করে যাচ্ছে। তবে পাঁচই আগস্ট ২০২৪ পরবর্তী পরিবর্তিত সময় গুলশান সোসাইটির সদস্যবৃন্দ নিজেরা সারা রাত জেগে রাস্তা পাহারা দিয়েছেন এবং এলাকাবাসীর নিরাপত্তা সুনিশ্চিত করেছেন। বর্তমানে দিনে এবং রাতে ২৪ ঘণ্টা গুলশান সোসাইটি ঢাকা মেট্রোপলিটন পুলিশের সঙ্গে পার্টনারশিপে কমিউনিটি পুলিশের মাধ্যমে এলাকাবাসীকে নিরাপত্তা দিচ্ছে।",
  },
  {
    id: 3,
    name: "কমিউনিটি পুলিশ",
    icon: UserGroupIcon,
    description: "গুলশানকে যানজট মুক্ত রাখার উদ্দেশ্যে ঢাকা উত্তর মেট্রোপলিটন (ট্রাফিক) পুলিশের সাথে কাঁধে কাঁধ মিলিয়ে কাজ করে যাচ্ছে গুলশান সোসাইটির কমিউনিটি পুলিশ বাহিনী। গুলশানের ব্যস্ততম সড়কগুলোকে যানজট মুক্ত রাখতে এবং ট্রাফিক আইনের প্রয়োগ সুনিশ্চিত করতে ২ জন সুপারভাইজারের নেতৃত্বে ৭০ সদস্যের কমিউনিটি পুলিশ বাহিনী নিরলস পরিশ্রম করছেন। গুলশান সোসাইটি কর্তৃক সরবরাহকৃত গাড়ির স্টিকার ব্যবহারের মাধ্যমে গুলশান সোসাইটির প্রতিটি সদস্য গুলশানে নির্বিঘ্নে চলাচল করতে পারে। আইন শৃঙ্খলা রক্ষাকারী সংস্থার সহযোগিতায় গুলশানের বিভিন্ন রাস্তা এবং লেকপাড়ে স্থাপিত অবৈধ ও অস্থায়ী দোকানপাট উচ্ছেদ ও বিভিন্ন অসামাজিক কার্যকলাপ বন্ধে নিয়মিত অভিযান চালানো হয়।",
  },
  {
    id: 4,
    name: "ল' এন্ড অর্ডার কো-অর্ডিনেশন কমিটি",
    icon: CameraIcon,
    description: "গুলশানকে অপরাধমুক্ত করার উদ্দেশ্যে ঢাকা মেট্রোপলিটন পুলিশের সহযোগিতায় গুলশান সোসাইটি তার সমমনা আবাসিক সোসাইটিগুলোকে নিয়ে গঠন করেছে ল' এন্ড অর্ডার কো-অর্ডিনেশন কমিটি (LOCC)। এই কমিটির অধীনে গুলশানে স্থাপন করা হয়েছে বিপুল সংখ্যক সিসি-ক্যামেরা যা গুলশান অঞ্চলকে একটি অপরাধমুক্ত এলাকায় পরিণত করেছে। বর্তমানে গুলশান সোসাইটির সঙ্গে LOCC অত্যন্ত ঘনিষ্ঠভাবে কাজ করছে এবং প্রথমবারের মতো গুলশান সোসাইটির সভাপতি বর্তমানে LOCC এর সভাপতি হিসেবেও দায়িত্ব পালন করছেন।",
  },
    {
    id: 5,
    name: "গুলশান লেক পরিচ্ছন্নতা",
    icon: WrenchScrewdriverIcon,
    description: "রাজউক ও গুলশান সোসাইটির মধ্যে সম্পাদিত সমঝোতা স্মারক অনুসারে ২ জন সুপারভাইজারের তত্ত্বাবধানে গুলশান সোসাইটির নিয়োগকৃত ২০ জন পরিচ্ছন্নকর্মী গুলশান-বনানী, গুলশান-বাড্ডা, গুলশান-শাহজাদপুর ও গুলশান-বারিধারা লেকসমূহের সার্বিক রক্ষণাবেক্ষণ ও সৌন্দর্য বর্ধনের কাজ চালিয়ে যাচ্ছে। সম্প্রতি প্রায় ৩ মাস যাবৎকাল ধরেই গুলশান লেকের কয়েকটি স্থানে দীর্ঘদিনের জমে থাকা বর্জ্য বিশেষ অভিযানের মাধ্যমে পরিষ্কার করা হচ্ছে, যাতে লেকের পানির গতিময়তা ফিরে আসে এবং তা একটি বিশালাকার নর্দমায় পরিণত না হয়।",
  },
  {
    id: 6,
    name: "গুলশান সোসাইটি লেক পার্ক",
    icon: BuildingOfficeIcon,
    description: "রাজউক কর্তৃক সম্পাদিত লীজ দলিল অনুসারে গুলশানের রোড নং৬২/৬৩ তে অবস্থিত লেক পার্কের সার্বিক ব্যবস্থাপনার দায়িত্বভার গুলশান সোসাইটির উপর অর্পণ করা হয়েছে। সেটির নিয়মিত রক্ষণাবেক্ষণ, পাবলিটিক টয়লেটের পরিচ্ছন্নতা, নিরাপত্তা, গাছপালার পরিচর‍্যা ইত্যাদি গুলশান সোসাইটির লেকপার্ক ম্যানেজমেন্ট কমিটি করে আসছে। কর্পোরেট স্পন্সরের সাথে নেগোসিয়েশনের মাধ্যমে সম্প্রতি সেখানে একটি অত্যাধুনিক চিল্ড্রেন'স কর্নার নির্মাণ করা হয়েছে।",
  },
  {
    id: 7,
    name: "বিচারপতি শাহাবুদ্দিন আহমেদ পার্ক",
    icon: HomeIcon,
    description: "গুলশানের হৃদয়ে অবস্থিত বিচারপতি শাহাবুদ্দিন আহমদ পার্ক এখন নতুন রূপে সাজতে যাচ্ছে। ঢাকা উত্তর সিটি কর্পোরেশনের সাথে সাম্প্রতিক ব্যবস্থাপনা চুক্তি অনুযায়ী গুলশান সোসাইটির তত্ত্বাবধানে এই পার্কের সার্বিক ব্যবস্থাপনা পরিচালিত হবে। প্রতিদিনের পরিচ্ছন্নতা, নিরবিচ্ছিন্ন নিরাপত্তা, গাছপালার যত্ন এবং সবুজ পরিবেশ রক্ষায় আমাদের পার্ক ম্যানেজমেন্ট কমিটি নিরলসভাবে কাজ করছে।",
  },
  {
     id: 8,
    name: "শহীদ ডাঃ ফজলে রাব্বী পার্ক",
    icon: HomeIcon,
    description: "গুলশানের ব্যস্ততার মাঝেও আপনাকে উপহার দেয় এক শান্ত সবুজ জগৎ। রাজউকের লীজ চুক্তির আওতায় গুলশান সোসাইটির তত্ত্বাবধানে এই পার্কের প্রতিটি কোণ পরিচ্ছন্ন, সুরক্ষিত ও ব্যবহারবান্ধব রাখা হয়। কর্পোরেট অংশীদারদের সহায়তায় পার্কে সংযোজন হয়েছে শিশুদের জন্য বিনোদন এলাকা, সুসজ্জিত বসার জায়গা, ওয়াকওয়ে এবং নান্দনিক সৌন্দর্যবর্ধন কাজ। এখানে প্রতিদিন সকাল-বিকেলের হাঁটাহাঁটি, পরিবারের সঙ্গে সময় কাটানো এবং বন্ধুদের আড্ডা হয়ে ওঠে আরও আনন্দময় ও স্মরণীয়।",
  },
  {
    id: 9,
    name: "মশক নিধন",
    icon: BeakerIcon,
    description: "প্রয়োজনের তুলনায় অপ্রতুল হলেও, গুলশান সোসাইটি মশক নিধনের জন্য সর্বাত্মক প্রচেষ্টা চালিয়ে যাচ্ছে। ঢাকা উত্তর সিটি কর্পোরেশনের কাছে প্রশিক্ষণ প্রাপ্ত কর্মীদের দিয়ে গুলশান ব্যাপী মশক নিধন কার্যক্রম চালানো হয়েছে। গত পাঁচ বছর যাবত মশক নিধনের ফগার মেশিন, কীটনাশক ও মশার ডিম মারার ঔষধ নিজস্ব খরচে ক্রয় করে তা নিয়মিত বিভিন্ন রাস্তায় ও লেকসাইডে ব্যবহার করা হচ্ছে। অতি সম্প্রতি গুলশান সোসাইটি Department of Commerce, US Government ও ডিএনসিসির সহযোগিতায় গুলশানে আমেরিকায় তৈরি পরিবেশ বান্ধব জৈব কীটনাশক ব্যবহার করে মশক নিধনের প্রচেষ্টা চালাচ্ছে।",
  },

  {
    id: 10,
    name: "সাংস্কৃতিক কার্যক্রম",
    icon: CalendarDaysIcon,
    description: "পহেলা বৈশাখ, একুশে ফেব্রুয়ারি, বিজয় দিবস, ইফতার মাহফিল সহ বিভিন্ন জাতীয় ও ধর্মীয় উদ্যাপন, এবং, পাড়া উৎসব, জীবন উৎসব, নজরুল উৎসব, নারী দিবস ইত্যাদি সামাজিক-সাংস্কৃতিক উৎসব পালনের মাধ্যমে গুলশান সোসাইটি সদস্যদের মধ্যে সম্প্রীতি ও সৌহার্দপূর্ণ বন্ধন বৃদ্ধির নিয়ামক হিসেবে কাজ করছে। গুলশানবাসীদের পরিবারের শিশু-কিশোরদের মধ্যে সুস্থ সংস্কৃতির বিকাশের লক্ষ্যে একুশের বইমেলা, কিডস' কার্নিভ্যাল, সাংস্কৃতিক পরিবেশনা ইত্যাদি আয়োজন করা হয়।",
  },
  {
    id:11,
    name:"চিকিৎসা সেবা",
    icon:CameraIcon,
    description:"গুলশান সোসাইটি তাদের সদস্যদের স্বাস্থ্যরক্ষায় সহায়তা করার লক্ষ্যে দেশি এবং বিদেশী বিভিন্ন আন্তর্জাতিক মানের হাসপাতাল, ডায়াগনস্টিক ল্যাব এবং অন্যান্য মেডিক্যাল সার্ভিস প্রোভাইডারের সঙ্গে সমঝোতা চুক্তি স্বাক্ষর করে। এই সমঝোতা চুক্তির প্রেক্ষিতে সোসাইটির প্রতিটি সদস্য চিকিৎসা সম্পর্কিত বিভিন্ন পরীক্ষা-নিরীক্ষা ও ট্রিটমেন্টে ১০% থেকে ৪০% পর‍্যন্ত ছাড় পেয়ে থাকেন। তাছাড়া, কয়েকটি সমঝোতা চুক্তির বদৌলতে সদস্যবৃন্দ দেশের বাহিরে চিকিত্সার ক্ষেত্রে ভিসা প্রসেসিং, বিমানে যাতায়াত এবং রোগীর হাসপাতালে ভর্তি সংক্রান্ত যাবতীয় সহায়তা পেয়ে থাকে।"
  },
  {
    id: 12,
    name: "নাগরিক সমস্যার সমাধান",
    icon: ExclamationTriangleIcon,
    description: "সদস্যদের যেকোনো নাগরিক বিপত্তি বা সমস্যা সম্পর্কে রিপোর্ট পাওয়ামাত্র গুলশান সোসাইটি আন্তরিকভাবে তার আশু সমাধান এবং নিষ্পত্তি করার চেষ্টা করে। এপ্রসঙ্গে সরকারী অফিস, ডিএনসিসি, ডিএমপি, রাজউক বা অন্যান্য কর্তৃপক্ষের হস্তক্ষেপ বা সহযোগিতা প্রয়োজন হলে গুলশান সোসাইটি সেই প্রয়োজনীয় যোগাযোগ ও ফলো-আপ করে থাকে।"
  },
  {
    id: 13,
    name: "দুর্যোগ মোকাবেলা",
    icon: FireIcon,
    description: "যেকোনো বিপদকালীন সময়ে (কোভিড মহামারি, প্রাকৃতিক দুর্যোগ, সাম্প্রতিক রাজনৈতিক অস্থিরতা-জনিত অনিরাপদ অবস্থা ইত্যাদি) গুলশান সোসাইটি অধিবাসীদের নিরাপত্তা নিশ্চিত করার লক্ষ্যে বিশেষ অভিযান ও র‍্যাপিড অ্যাকশন মিশন নিয়ে থাকে।"
  },
  {
    id: 14,
    name: "গুলশান সোসাইটি জামে মসজিদ",
    icon:BuildingOffice2Icon,
    description: "এই মসজিদ এলাকাবাসীর অত্যন্ত প্রিয় ইবাদত স্থল। একদিকে অপূর্ব স্থাপত্য শিল্প অন্যদিকে ধর্মীয় কর্মকাণ্ড ও আত্মিক উন্নয়নের কাজে এ মসজিদ গুলশান এলাকায় গুরুত্বপূর্ণ ভূমিকা পালন করছে।"
  },
];

export const futurePlan = [
  {
    id: 1,
    icon: LockClosedIcon,
    description: "নিরাপত্তা জোরদার করবার জন্য প্রধান ৬৮টি এন্ট্রিপয়েন্টে সিকিউরিটি গেইট নির্মাণ এবং ক্রমশ প্রতি জোনে রাত্রিকালীন সময়ে নিরাপত্তার জন্য সীমিত প্রবেশপথ নিশ্চিত করা।"
  },
  {
    id: 2,
    icon: TruckIcon,
    description: "ডিএমপি'র সহায়তায় ট্রাফিক ব্যবস্থার উল্লেখযোগ্য এবং কার্যকর উন্নয়ন।"
  },
  {
    id: 3,
    icon: CircleStackIcon,
    description: "গুলশানের রিকশা ও রিকশাচালকের রেজিস্ট্রেশন পদ্ধতি, ভাড়ার রেইটচার্ট, চলাচলের রুট ইত্যাদি নতুনরূপে কঠোর বাস্তবায়নের মাধ্যমে এ এলাকার রিকশা-ট্রাফিক ও ব্যবহারকারীদের সুবিধা নিশ্চিত করা।"
  },
  {
    id: 4,
    icon: MapPinIcon,
    description: "ইন্টারনাল রোডগুলোতে যথাযথ পার্কিংয়ের কঠোর বাস্তবায়ন।"
  },
  {
    id: 5,
    icon: ScaleIcon,
    description: "ডিএনসিসি-র সহায়তায় নির্দিষ্ট স্থানে আধুনিক মোবাইল কোর্টের ব্যবস্থা করে টং-দোকানগুলির কার্যকরী আইনি পদ্ধতিতে উচ্ছেদ কার্যক্রম।"
  },
  {
    id: 6,
    icon: PaintBrushIcon,
    description: "রাজউক এবং ডিএনসিসি'র সহায়তায় লেক সমূহের পাড় বাঁধাই এবং সৌন্দর্য বর্ধন।"
  },
  {
    id: 7,
    icon: ArrowsPointingOutIcon,
    description: "গৃহস্থালি বর্জ্য সংগ্রহ প্রক্রিয়ার আধুনিকায়ন।"
  },
  {
    id: 8,
    icon: HeartIcon,
    description: "অত্যাধুনিক অ্যাম্বুলেন্স সার্ভিস প্রদানের সুব্যবস্থা।"
  },
  {
    id: 9,
    icon: LegalScaleIcon,
    description: "মহিলাদের জন্য আইনি সহায়তা প্রদানের ব্যবস্থা।"
  },
  {
    id: 10,
    icon: PhoneIcon,
    description: "সার্বক্ষণিক ইমারজেন্সি হটলাইন।"
  },
  {
    id: 11,
    icon: AcademicCapIcon,
    description: "শিশু-কিশোরদের গান, আবৃত্তি, ছবি আঁকা, খেলাধুলা ইত্যাদি শেখানোর জন্য নানাধরণের কোর্সের ব্যবস্থা।"
  },
  {
    id: 12,
    icon: BuildingLibraryIcon,
    description: "২০৩০ সালের মধ্যেই গুলশান সোসাইটির পরিচালনায় একটি মাল্টি-পারপাস সোসাইটি সেন্টার নির্মাণ, যেখানে কমিউনিটি সেন্টার, আধুনিক অডিটোরিয়াম, লাইব্রেরি, শিল্পশিক্ষা একাডেমি, এগজিবিশন গ্যালারি, জরুরি সেবা অফিস ইত্যাদি থাকবে।"
  }
];

